ms-rtos/bspstm32f4xx/src/driver/stm32_drv_usart.c
/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: stm32_drv_usart.c
**
** 创   建   人: Jiao.jinxing
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: STM32 芯片 USART 驱动
*********************************************************************************************************/
#define __MS_IO
#include "ms_config.h"
#include "ms_rtos.h"
#include "ms_io_core.h"

#include <string.h>

#include "includes.h"
#include "stm32_drv_usart.h"

#if BSP_CFG_USART_EN > 0

#define __STM32_USART_MAX_CHANNEL                   (6)

/*
 * Hardware configuration checking
 */
#define __STM32_USART_BAUDRATE_VALID(BAUDRATE)      ((BAUDRATE) < 10500001)

/*
 * Clear the USART PE pending flag.
 */
#define __STM32_HAL_USART_CLEAR_PEFLAG(__INSTANCE__) \
    do{                                              \
        __IO ms_uint32_t tmpreg = 0x00;              \
        tmpreg = (__INSTANCE__)->SR;                 \
        tmpreg = (__INSTANCE__)->DR;                 \
        UNUSED(tmpreg);                              \
    } while(0)

/*
 * Clear the USART FE pending flag.
 */
#define __STM32_HAL_USART_CLEAR_FEFLAG(__INSTANCE__)     __STM32_HAL_USART_CLEAR_PEFLAG(__INSTANCE__)

/*
 * Clear the USART NE pending flag.
 */
#define __STM32_HAL_USART_CLEAR_NEFLAG(__INSTANCE__)     __STM32_HAL_USART_CLEAR_PEFLAG(__INSTANCE__)

/*
 * Clear the USART ORE pending flag.
 */
#define __STM32_HAL_USART_CLEAR_OREFLAG(__INSTANCE__)    __STM32_HAL_USART_CLEAR_PEFLAG(__INSTANCE__)

/*
 * Clear the USART IDLE pending flag.
 */
#define __STM32_HAL_USART_CLEAR_IDLEFLAG(__INSTANCE__)   __STM32_HAL_USART_CLEAR_PEFLAG(__INSTANCE__)

/*
 * USART_Private_Constants
 */
#define DUMMY_DATA           0xFFFFU

/*
 * Private info
 */
typedef struct {
    ms_pollfd_t          *slots[1];
    ms_addr_t             base;
    IRQn_Type             irq;
    ms_uart_param_t       param;
    ms_fifo_t             rx_fifo;
    ms_fifo_t             tx_fifo;
    ms_handle_t           rx_semb;
    ms_handle_t           tx_semb;
    USART_HandleTypeDef  *usart_handler;
} privinfo_t;

/*
 * stm32 usart device
 */
typedef struct {
    privinfo_t      priv;
    ms_io_device_t  dev;
} stm32_usart_dev_t;

/*
 * @brief Global data area
 */
static stm32_usart_dev_t __stm32_usart_devs[__STM32_USART_MAX_CHANNEL];

/*
 * Enable the peripheral: __HAL_USART_ENABLE(husart);
 */
static inline void __stm32_usart_enable(privinfo_t *priv)
{
    __HAL_USART_ENABLE(priv->usart_handler);
}

/*
 * Disable the peripheral: __HAL_USART_DISABLE(husart);
 */
static inline void __stm32_usart_disable(privinfo_t *priv)
{
    __HAL_USART_DISABLE(priv->usart_handler);
}

/*
 * USART interruption enable/disable: HAL_NVIC_EnableIRQ HAL_NVIC_DisableIRQ
 */
static inline void __stm32_usart_int_set(privinfo_t *priv, ms_uint8_t enable)
{
    if (enable) {
        HAL_NVIC_EnableIRQ(priv->irq);
    } else {
        HAL_NVIC_DisableIRQ(priv->irq);
    }
}

/*
 * USART interruption priority setting: HAL_NVIC_SetPriority
 */
static inline void __stm32_usart_int_prio_set(privinfo_t *priv, ms_uint32_t preempt_prio, ms_uint32_t sub_prio)
{
    HAL_NVIC_SetPriority(priv->irq, preempt_prio, sub_prio);
}

/*
 * USART interruption priority getting: HAL_NVIC_GetPriority
 */
static inline void __stm32_usart_int_prio_get(privinfo_t *priv, ms_uint32_t *preempt_prio, ms_uint32_t *sub_prio)
{
    if (!preempt_prio || !sub_prio) {
        return;
    }
    HAL_NVIC_GetPriority(priv->irq, HAL_NVIC_GetPriorityGrouping(), (uint32_t *)preempt_prio, (uint32_t *)sub_prio);
}

/*
 * USART interruption mode setting: __HAL_USART_ENABLE_IT __HAL_USART_DISABLE_IT
 */
static void __stm32_usart_int_mode_set(privinfo_t *priv, ms_uint32_t interrupt, ms_uint8_t enable)
{
    if (enable) {
        __HAL_USART_ENABLE_IT(priv->usart_handler, interrupt);
    } else {
        __HAL_USART_DISABLE_IT(priv->usart_handler, interrupt);
    }
}

/*
 * USART interruption mode getting: HAL_USART_IRQHandler
 */
static inline ms_uint32_t __stm32_usart_int_mode_get(privinfo_t *priv, ms_uint32_t interrupt)
{
    USART_TypeDef *instance = (USART_TypeDef *)(priv->base);

    return (((((interrupt) >> 28) == 1)? instance->CR1:(((((ms_uint32_t)(interrupt)) >> 28) == 2)? \
             instance->CR2 : instance->CR3)) & (((ms_uint32_t)(interrupt)) & USART_IT_MASK));
}

/*
 * Initialize usart interruption system: HAL_USART_Receive_IT HAL_USART_Receive_IT
 */
static void __stm32_usart_interrupt_config(privinfo_t *priv)
{
    USART_HandleTypeDef *husart = priv->usart_handler;

    /* Process Locked */
    __stm32_usart_int_set(priv, MS_FALSE);

    /* Enable the USART Parity Error and Data Register not empty Interrupts */
    SET_BIT(husart->Instance->CR1, USART_CR1_PEIE | USART_CR1_RXNEIE);

    /* Enable the USART Error Interrupt: (Frame error, noise error, overrun error) */
    SET_BIT(husart->Instance->CR3, USART_CR3_EIE);

    /* Send dummy byte in order to generate the clock for the slave to send data */
    husart->Instance->DR = (DUMMY_DATA & (uint16_t)0x01FF);

    /* Configure priority */
    __stm32_usart_int_prio_set(priv, 1, 3);

    /* Process Unlocked */
    __stm32_usart_int_set(priv, MS_TRUE);
}

/*********************************************************************************************************
 Above interfaces are hardware relevant
*********************************************************************************************************/

/*
 * Convert ms_uart_param_t to native structure usart_init_t
 */
static int __stm32_usart_param_covert_to_hal_flag(ms_uart_param_t *param, USART_InitTypeDef *init)
{
    if (__STM32_USART_BAUDRATE_VALID(param->baud)) {
        init->BaudRate = param->baud;
    } else {
        return MS_ERR;
    }

