ms-rtos/bspstm32f4xx/src/driver/stm32_drv_usart.c
    if (param->data_bits == MS_UART_DATA_BITS_8B) {
        init->WordLength = USART_WORDLENGTH_8B;
    } else if (param->data_bits == MS_UART_DATA_BITS_9B) {
        init->WordLength = USART_WORDLENGTH_9B;
    } else {
        return MS_ERR;
    }

    if (param->stop_bits == MS_UART_STOP_BITS_1B) {
        init->StopBits = USART_STOPBITS_1;
    } else if (param->stop_bits == MS_UART_STOP_BITS_2B) {
        init->StopBits = USART_STOPBITS_2;
    } else {
        return MS_ERR;
    }

    if (param->parity == MS_UART_PARITY_NONE) {
        init->Parity = USART_PARITY_NONE;
    } else if (param->parity == MS_UART_PARITY_ODD) {
        init->Parity = USART_PARITY_ODD;
    } else if (param->parity == MS_UART_PARITY_EVEN) {
        init->Parity = USART_PARITY_EVEN;
    } else {
        return MS_ERR;
    }

    if (param->mode == MS_UART_MODE_RX) {
        init->Mode = USART_MODE_RX;
    } else if (param->mode == MS_UART_MODE_TX) {
        init->Mode = USART_MODE_TX;
    } else if (param->mode == MS_UART_MODE_TX_RX) {
        init->Mode = USART_MODE_TX_RX;
    } else {
        return MS_ERR;
    }

    if (param->clk_pol == MS_UART_CPOL_LOW) {
        init->CLKPolarity = USART_POLARITY_LOW;
    } else if (param->clk_pol == MS_UART_CPOL_HIGH) {
        init->CLKPhase = USART_POLARITY_HIGH;
    } else {
        return MS_ERR;
    }

    if (param->clk_pha == MS_UART_CPHA_1EDGE) {
        init->CLKPhase = USART_PHASE_1EDGE;
    } else if (param->clk_pha == MS_UART_CPHA_2EDGE) {
        init->CLKPhase = USART_PHASE_2EDGE;
    } else {
        return MS_ERR;
    }

    if (param->clk_last_bit == MS_UART_LAST_BIT_DISABLE) {
        init->CLKLastBit = USART_LASTBIT_DISABLE;
    } else if (param->clk_last_bit == MS_UART_LAST_BIT_ENABLE) {
        init->CLKLastBit = USART_LASTBIT_ENABLE;
    } else {
        return MS_ERR;
    }

    /*
     * fix config->word_length
     */
    if (param->data_bits == MS_UART_DATA_BITS_8B &&
        param->parity != MS_UART_PARITY_NONE) {
        init->WordLength = USART_WORDLENGTH_9B;
    }

    return MS_ERR_NONE;
}

/*
 * Convert local param to HAL flags
 */
static ms_err_t __stm32_usart_param_covert(privinfo_t *priv)
{
    return __stm32_usart_param_covert_to_hal_flag(&priv->param, &priv->usart_handler->Init);
}

/*
 * Initialize serial port
 */
static ms_err_t __stm32_usart_hw_init(privinfo_t *priv)
{
    HAL_StatusTypeDef ret;

    ret = HAL_USART_Init(priv->usart_handler);
    if (ret == HAL_OK) {
        return MS_ERR_NONE;
    } else {
        return MS_ERR;
    }
}

/*
 * Open device
 */
static int __stm32_usart_open(ms_ptr_t ctx, ms_io_file_t *file, int oflag, ms_mode_t mode)
{
    privinfo_t *priv = ctx;
    int ret;

    if (ms_atomic_inc(MS_IO_DEV_REF(file)) == 1) {

        priv->param.baud      = 115200;
        priv->param.data_bits = MS_UART_DATA_BITS_8B;
        priv->param.stop_bits = MS_UART_STOP_BITS_1B;
        priv->param.parity    = MS_UART_PARITY_NONE;
        priv->param.flow_ctl  = MS_UART_FLOW_CTL_NONE;
        priv->param.mode      = MS_UART_MODE_TX_RX;

        if (__stm32_usart_param_covert(priv) == MS_ERR_NONE) {
            if (__stm32_usart_hw_init(priv) == MS_ERR_NONE) {
                __stm32_usart_interrupt_config(priv);
                ret = 0;
            } else {
                ms_atomic_dec(MS_IO_DEV_REF(file));
                ms_thread_set_errno(ENODEV);
                ret = -1;
            }
        } else {
            ms_atomic_dec(MS_IO_DEV_REF(file));
            ms_thread_set_errno(EINVAL);
            ret = -1;
        }

    } else {
        ms_atomic_dec(MS_IO_DEV_REF(file));
        ms_thread_set_errno(EBUSY);
        ret = -1;
    }

    return ret;
}

/*
 * Close device
 */
static int __stm32_usart_close(ms_ptr_t ctx, ms_io_file_t *file)
{
    privinfo_t *priv = ctx;

    if (ms_atomic_dec(MS_IO_DEV_REF(file)) == 0) {

        __stm32_usart_int_set(priv, MS_FALSE);
        HAL_USART_DeInit(priv->usart_handler);

        ms_fifo_reset(&priv->rx_fifo);
        ms_fifo_reset(&priv->tx_fifo);

        bzero(&priv->param, sizeof(priv->param));
    }

    return 0;
}

/*
 * Read device
 */
static ms_ssize_t __stm32_usart_read(ms_ptr_t ctx, ms_io_file_t *file, ms_ptr_t buf, ms_size_t len)
{
    privinfo_t *priv = ctx;
    ms_ssize_t ret = 0;

    ms_uint8_t *cbuf = buf;
    ms_uint32_t read_len;

    while (len > 0) {

        if (ms_fifo_is_empty(&priv->rx_fifo)) {
            if (file->flags & FNONBLOCK) {
                break;
            } else {
                (void)ms_semb_wait(priv->rx_semb, MS_TIMEOUT_FOREVER);
            }
        }

        read_len = ms_fifo_get(&priv->rx_fifo, cbuf, len);
        ret  += read_len;
        len  -= read_len;
        cbuf += read_len;

        break;
    }

    return ret;
}

/*
 * Write device
 */
static ms_ssize_t __stm32_usart_write(ms_ptr_t ctx, ms_io_file_t *file, ms_const_ptr_t buf, ms_size_t len)
{
    ms_arch_sr_t sr;
    privinfo_t *priv = ctx;
    ms_ssize_t ret = 0;
    const ms_uint8_t *cbuf = buf;
    ms_uint32_t write_len;

    while (len > 0) {

        if (ms_fifo_is_full(&priv->tx_fifo)) {
            if (file->flags & FNONBLOCK) {
                break;
            } else {
                (void)ms_semb_wait(priv->tx_semb, MS_TIMEOUT_FOREVER);
            }
        }

        write_len = ms_fifo_put(&priv->tx_fifo, cbuf, len);

        sr = ms_arch_int_disable();
        __stm32_usart_int_mode_set(priv, USART_IT_TXE, MS_TRUE);
        ms_arch_int_resume(sr);

        ret  += write_len;
        len  -= write_len;
        cbuf += write_len;
    }

    return ret;
}

/*
 * Control device
 */
static int __stm32_usart_ioctl(ms_ptr_t ctx, ms_io_file_t *file, int cmd, void *arg)
{
    ms_arch_sr_t sr;
    privinfo_t *priv = ctx;
    ms_err_t err;
    int ret = 0;

    switch (cmd) {
    case MS_UART_CMD_GET_PARAM:
        if (ms_access_ok(arg, sizeof(ms_uart_param_t), MS_ACCESS_W)) {
            if (arg != NULL) {
                *(ms_uart_param_t *)arg = priv->param;
                ret = 0;
            } else {
                ms_thread_set_errno(EINVAL);
                ret = -1;
            }
        } else {
            ms_thread_set_errno(EFAULT);
            ret = -1;
        }
        break;

