ms-rtos/bspstm32f4xx/src/driver/stm32_drv_usart.c
    case MS_UART_CMD_SET_PARAM:
        if (ms_access_ok(arg, sizeof(ms_uart_param_t), MS_ACCESS_R)) {
            if (arg != NULL) {
                priv->param = *(ms_uart_param_t *)arg;

                err = __stm32_usart_param_covert(priv);
                if (err == MS_ERR_NONE) {
                    __stm32_usart_hw_init(priv);
                    ret = 0;
                } else {
                    ms_thread_set_errno(EINVAL);
                    ret = -1;
                }
            } else {
                ms_thread_set_errno(EINVAL);
                ret = -1;
            }
        } else {
            ms_thread_set_errno(EFAULT);
            ret = -1;
        }
        break;

    case MS_UART_CMD_FLUSH_RX:
        sr = ms_arch_int_disable();
        ms_fifo_reset(&priv->rx_fifo);
        ms_arch_int_resume(sr);
        ret = 0;
        break;

    case MS_UART_CMD_DRAIN_TX:
        while (ms_fifo_is_empty(&priv->tx_fifo) != MS_TRUE) {
            __stm32_usart_int_mode_set(priv, USART_IT_TXE, MS_TRUE);
            (void)ms_semb_wait(priv->tx_semb, MS_TIMEOUT_FOREVER);
        }
        ret = 0;
        break;

    default:
        ms_thread_set_errno(EINVAL);
        ret = -1;
        break;
    }

    return ret;
}

/*
 * Get device status
 */
static int __stm32_usart_fstat(ms_ptr_t ctx, ms_io_file_t *file, ms_stat_t *buf)
{
    privinfo_t *priv = ctx;

    buf->st_size = ms_fifo_size(&priv->rx_fifo);

    return 0;
}

/*
 * Check device readable
 */
static ms_bool_t __stm32_usart_readable_check(ms_ptr_t ctx)
{
    privinfo_t *priv = ctx;

    return ms_fifo_is_empty(&priv->rx_fifo) ? MS_FALSE : MS_TRUE;
}

/*
 * Check device writable
 */
static ms_bool_t __stm32_usart_writable_check(ms_ptr_t ctx)
{
    privinfo_t *priv = ctx;

    return ms_fifo_is_full(&priv->tx_fifo) ? MS_FALSE : MS_TRUE;
}

/*
 * Check device exception
 */
static ms_bool_t __stm32_usart_except_check(ms_ptr_t ctx)
{
    privinfo_t *priv = ctx;

    (void)priv;

    /*
     * NOTE: __stm32_usart_isr ===> __stm32_usart_poll_notify(priv, POLLERR);
     */

    return MS_FALSE;
}

/*
 * Device notify
 */
static int __stm32_usart_poll_notify(privinfo_t *priv, ms_pollevent_t event)
{
    return ms_io_poll_notify_heaper(priv->slots, MS_ARRAY_SIZE(priv->slots), event);
}

/*
 * Poll device
 */
static int __stm32_usart_poll(ms_ptr_t ctx, ms_io_file_t *file, ms_pollfd_t *fds, ms_bool_t setup)
{
    privinfo_t *priv = ctx;

    return ms_io_poll_heaper(fds, priv->slots, MS_ARRAY_SIZE(priv->slots), setup, ctx,
                             __stm32_usart_readable_check, __stm32_usart_writable_check, __stm32_usart_except_check);;
}

/*
 * Receives an amount of data in non blocking mode
 */
static int __stm32_usart_receive_int(privinfo_t *priv)
{
    USART_TypeDef *instance = (USART_TypeDef *)(priv->base);
    ms_uint16_t data = 0;

    if (priv->usart_handler->Init.WordLength == USART_WORDLENGTH_9B) {
        if (priv->usart_handler->Init.Parity == USART_PARITY_NONE) {
            data  = (ms_uint16_t)(instance->DR & (ms_uint16_t)0x01FF);
            ms_fifo_put(&priv->rx_fifo, (ms_uint8_t *)&data, 2);
        } else {
            data = (ms_uint16_t)(instance->DR & (ms_uint16_t)0x00FF);
            ms_fifo_put(&priv->rx_fifo, (ms_uint8_t *)&data, 1);
        }
    } else {
        if (priv->usart_handler->Init.Parity == USART_PARITY_NONE) {
            data = (ms_uint8_t)(instance->DR & (ms_uint8_t)0x00FF);
            ms_fifo_put(&priv->rx_fifo, (ms_uint8_t *)&data, 1);
        } else {
            data = (ms_uint8_t)(instance->DR & (ms_uint8_t)0x007F);
            ms_fifo_put(&priv->rx_fifo, (ms_uint8_t *)&data, 1);
        }
    }

    (void)ms_semb_post(priv->rx_semb);
    __stm32_usart_poll_notify(priv, POLLIN);

    return MS_ERR_NONE;
}

/*
 * Sends an amount of data in non blocking mode.
 */
static int __stm32_usart_transmit_int(privinfo_t *priv)
{
    USART_TypeDef *instance = (USART_TypeDef *)(priv->base);
    ms_uint16_t data = 0;

    if (priv->usart_handler->Init.WordLength == USART_WORDLENGTH_9B) {
        if (priv->usart_handler->Init.Parity == USART_PARITY_NONE) {
            ms_fifo_get(&priv->tx_fifo, (ms_uint8_t *)&data, 2);
            instance->DR = (ms_uint16_t)(data & (ms_uint16_t)0x01FF);
        } else {
            ms_fifo_get(&priv->tx_fifo, (ms_uint8_t *)&data, 1);
            instance->DR = (ms_uint16_t)(data & (ms_uint16_t)0x01FF);
        }
    } else {
        ms_fifo_get(&priv->tx_fifo, (ms_uint8_t *)&data, 1);
        instance->DR = (ms_uint8_t)(data & (ms_uint8_t)0x00FF);
    }

    if (ms_fifo_is_empty(&priv->tx_fifo) == MS_TRUE) {
        __stm32_usart_int_mode_set(priv, USART_IT_TXE, MS_FALSE);
    }

    (void)ms_semb_post(priv->tx_semb);
    __stm32_usart_poll_notify(priv, POLLOUT);

    return MS_ERR_NONE;
}

/*
 * Wraps up transmission in non blocking mode.
 */
static int __stm32_usart_endtransmit_int(privinfo_t *priv)
{
    /* Disable the USART Transmit Complete Interrupt */
    __stm32_usart_int_mode_set(priv, USART_IT_TC, MS_FALSE);

    return MS_ERR_NONE;
}

/*
 * Full-Duplex Send receive an amount of data in full-duplex mode (non-blocking).
 */
static int __stm32_usart_trans_recv_int(privinfo_t *priv)
{
    USART_TypeDef *instance = (USART_TypeDef *)(priv->base);
    USART_HandleTypeDef *husart = priv->usart_handler;
    ms_uint16_t data = 0;

    if (ms_fifo_is_empty(&priv->tx_fifo) != MS_TRUE) {
        if (__HAL_USART_GET_FLAG(husart, USART_FLAG_TXE) != RESET) {
            if (husart->Init.WordLength == USART_WORDLENGTH_9B) {
                if (husart->Init.Parity == USART_PARITY_NONE) {
                    ms_fifo_get(&priv->tx_fifo, (ms_uint8_t *)&data, 2);
                    instance->DR = (ms_uint16_t)(data & (ms_uint16_t)0x01FF);
                } else {
                    ms_fifo_get(&priv->tx_fifo, (ms_uint8_t *)&data, 1);
                    instance->DR = (ms_uint16_t)(data & (ms_uint16_t)0x01FF);
                }
            } else {
                ms_fifo_get(&priv->tx_fifo, (ms_uint8_t *)&data, 1);
                instance->DR = (ms_uint8_t)(data & (ms_uint8_t)0x00FF);
            }

            if (ms_fifo_is_empty(&priv->tx_fifo) == MS_TRUE) {
                __stm32_usart_int_mode_set(priv, USART_IT_TXE, MS_FALSE);
            }

            (void)ms_semb_post(priv->tx_semb);
            __stm32_usart_poll_notify(priv, POLLOUT);
        }
    }

