ms-rtos/bspstm32f4xx/src/driver/stm32_drv_usart.c
    if (ms_fifo_is_full(&priv->rx_fifo) != MS_TRUE) {
        if (__HAL_USART_GET_FLAG(husart, USART_FLAG_RXNE) != RESET) {
            if (husart->Init.WordLength == USART_WORDLENGTH_9B) {
                if (husart->Init.Parity == USART_PARITY_NONE) {
                    data  = (ms_uint16_t)(instance->DR & (ms_uint16_t)0x01FF);
                    ms_fifo_put(&priv->rx_fifo, (ms_uint8_t *)&data, 2);
                } else {
                    data = (ms_uint16_t)(instance->DR & (ms_uint16_t)0x00FF);
                    ms_fifo_put(&priv->rx_fifo, (ms_uint8_t *)&data, 1);
                }
            } else {
                if (husart->Init.Parity == USART_PARITY_NONE) {
                    data = (ms_uint8_t)(instance->DR & (ms_uint8_t)0x00FF);
                    ms_fifo_put(&priv->rx_fifo, (ms_uint8_t *)&data, 1);
                } else {
                  data = (ms_uint8_t)(instance->DR & (ms_uint8_t)0x007F);
                  ms_fifo_put(&priv->rx_fifo, (ms_uint8_t *)&data, 1);
                }
            }
        }
    }

    return MS_ERR_NONE;
}

/*
 * This function handles USART interrupt request.
 */
static void __stm32_usart_isr(privinfo_t *priv)
{
    ms_uint32_t pending = 0;
    ms_uint32_t tmp1 = 0, tmp2 = 0;
    USART_TypeDef *instance = (USART_TypeDef *)(priv->base);

    /* Disable usart interrupt */
    __stm32_usart_int_set(priv, MS_FALSE);

    /* Read and clear interrupt pending  */
    pending = instance->SR;

    /* Clear usart device error_code */
    priv->usart_handler->ErrorCode = HAL_USART_ERROR_NONE;

    tmp1 = ((pending & USART_FLAG_PE) == (USART_FLAG_PE));
    tmp2 = __stm32_usart_int_mode_get(priv, USART_IT_PE);
    /* USART parity error interrupt occurred */
    if ((tmp1 != RESET) && (tmp2 != RESET))
    {
        __STM32_HAL_USART_CLEAR_PEFLAG(instance);
        priv->usart_handler->ErrorCode |= HAL_USART_ERROR_PE;
    }

    tmp1 = ((pending & USART_FLAG_FE) == (USART_FLAG_FE));
    tmp2 = __stm32_usart_int_mode_get(priv, USART_IT_ERR);
    /* USART frame error interrupt occurred */
    if ((tmp1 != RESET) && (tmp2 != RESET))
    {
        __STM32_HAL_USART_CLEAR_FEFLAG(instance);
        priv->usart_handler->ErrorCode |= HAL_USART_ERROR_FE;
    }

    tmp1 = ((pending & USART_FLAG_NE) == (USART_FLAG_NE));
    tmp2 = __stm32_usart_int_mode_get(priv, USART_IT_ERR);
    /* USART noise error interrupt occurred */
    if ((tmp1 != RESET) && (tmp2 != RESET))
    {
        __STM32_HAL_USART_CLEAR_NEFLAG(instance);
        priv->usart_handler->ErrorCode |= HAL_USART_ERROR_NE;
    }

    tmp1 = ((pending & USART_FLAG_ORE) == (USART_FLAG_ORE));
    tmp2 = __stm32_usart_int_mode_get(priv, USART_IT_ERR);
    /* USART Over-Run interrupt occurred */
    if ((tmp1 != RESET) && (tmp2 != RESET))
    {
        __STM32_HAL_USART_CLEAR_OREFLAG(instance);
        priv->usart_handler->ErrorCode |= HAL_USART_ERROR_ORE;
    }

    tmp1 = ((pending & USART_FLAG_RXNE) == (USART_FLAG_RXNE));
    tmp2 = __stm32_usart_int_mode_get(priv, USART_IT_RXNE);
    /* USART in mode Receiver */
    if ((tmp1 != RESET) && (tmp2 != RESET))
    {
        __stm32_usart_receive_int(priv);
    }

    tmp1 = ((pending & USART_FLAG_TXE) == (USART_FLAG_TXE));
    tmp2 = __stm32_usart_int_mode_get(priv, USART_IT_TXE);
    /* USART in mode Transmitter */
    if ((tmp1 != RESET) && (tmp2 != RESET))
    {
        __stm32_usart_transmit_int(priv);
    }

    tmp1 = ((pending & USART_FLAG_TC) == (USART_FLAG_TC));
    tmp2 = __stm32_usart_int_mode_get(priv, USART_IT_TC);
    /* USART in mode Transmitter end */
    if ((tmp1 != RESET) && (tmp2 != RESET))
    {
        __stm32_usart_endtransmit_int(priv);
    }

    if (priv->usart_handler->ErrorCode != HAL_USART_ERROR_NONE)
    {
        /* Set the USART state ready to be able to start again the process */
        priv->usart_handler->State = HAL_USART_STATE_READY;
        __stm32_usart_poll_notify(priv, POLLERR);
    }

    /* Enable usart interrupt */
    __stm32_usart_int_set(priv, MS_TRUE);
}

/*
 * Handle USART IRQ
 */
void stm32_usart_irq_handler(ms_uint8_t channel)
{
    stm32_usart_dev_t *dev = &__stm32_usart_devs[channel - 1];

    __stm32_usart_isr(&dev->priv);
}

/*
 * Device operating function set
 */
static const ms_io_driver_ops_t stm32_usart_drv_ops = {
        .type   = MS_IO_DRV_TYPE_CHR,
        .open   = __stm32_usart_open,
        .close  = __stm32_usart_close,
        .write  = __stm32_usart_write,
        .read   = __stm32_usart_read,
        .ioctl  = __stm32_usart_ioctl,
        .fstat  = __stm32_usart_fstat,
        .poll   = __stm32_usart_poll,
};

/*
 * Device driver
 */
static ms_io_driver_t stm32_usart_drv = {
        .nnode = {
            .name = "stm32_usart",
        },
        .ops = &stm32_usart_drv_ops,
};

/*
 * Register USART device driver
 */
ms_err_t stm32_usart_drv_register(void)
{
    return ms_io_driver_register(&stm32_usart_drv);
}

/*
 * Create USART device file
 */
ms_err_t stm32_usart_dev_create(const char *path, ms_uint8_t channel,
                               ms_uint32_t rx_buf_size, ms_uint32_t tx_buf_size)
{
    stm32_usart_dev_t  *usart_dev;
    ms_ptr_t            buffer_ptr;
    ms_err_t            err = MS_ERR_NONE;

    if ((path == MS_NULL) || (channel > __STM32_USART_MAX_CHANNEL) || (channel == 0U)) {
        return MS_ERR;
    }

    usart_dev = &__stm32_usart_devs[channel - 1U];
    bzero(&usart_dev->priv, sizeof(usart_dev->priv));

    if (stm32_usart_get_hw_info(channel, &usart_dev->priv.irq, &usart_dev->priv.usart_handler) != MS_ERR_NONE) {
        return MS_ERR;
    }

    usart_dev->priv.base = (ms_addr_t)usart_dev->priv.usart_handler->Instance;

    rx_buf_size = ms_roundup_pow2_size(rx_buf_size);
    tx_buf_size = ms_roundup_pow2_size(tx_buf_size);

    buffer_ptr = ms_kmalloc(rx_buf_size + tx_buf_size);
    if (buffer_ptr == MS_NULL) {
        return MS_ERR;
    }

    ms_fifo_init(&usart_dev->priv.rx_fifo, (ms_uint8_t *)buffer_ptr, rx_buf_size);
    ms_fifo_init(&usart_dev->priv.tx_fifo, (ms_uint8_t *)buffer_ptr + rx_buf_size, tx_buf_size);

    err = ms_semb_create("usart_rx_semb", MS_FALSE, MS_WAIT_TYPE_PRIO, &usart_dev->priv.rx_semb);
    if (err != MS_ERR_NONE) {
        goto err_rx_semb;
    }

    err = ms_semb_create("usart_tx_semb", MS_FALSE, MS_WAIT_TYPE_PRIO, &usart_dev->priv.tx_semb);
    if (err != MS_ERR_NONE) {
        goto err_tx_semb;
    }

    err = ms_io_device_register(&usart_dev->dev, path, "stm32_usart", &usart_dev->priv);
    if (err != MS_ERR_NONE) {
        goto err_dev_reg;
    }

    return MS_ERR_NONE;

err_dev_reg:
    ms_semb_destroy(usart_dev->priv.tx_semb);

err_tx_semb:
    ms_semb_destroy(usart_dev->priv.rx_semb);

err_rx_semb:
    ms_kfree(buffer_ptr);

    return MS_ERR;
}

#endif
/*********************************************************************************************************
  END
*********************************************************************************************************/
